app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."created_at" DESC  [["user_id", 1]]
---
  def index
      @q = current_user.tasks.ransack(params[:q])
      @tasks= @q.result(distinct: true).page(params[:page])

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "新規作成のテストを書く"], ["description", ""], ["created_at", "2020-01-11 05:53:32.783420"], ["updated_at", "2020-01-11 05:53:32.783420"], ["user_id", 60]]
---
  def create
      @task = current_user.tasks.new(task_params)

      if params[:back].present?
          render :new
          return
      end

      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 17], ["id", 14], ["LIMIT", 1]]
---
  def set_task
      @task = current_user.tasks.find(params[:id])